# 运算

In [1]:
import pandas as pd
import numpy as np

## Dataframe运算

In [2]:
df = pd.DataFrame(np.random.rand(4, 3), index=['a', 'b', 'c', 'd'], columns=['first', 'second', 'third'])
df

      first    second     third
a  0.601114  0.234627  0.853911
b  0.063437  0.717170  0.123952
c  0.688637  0.141112  0.115866
d  0.127837  0.264889  0.487734

In [3]:
# point-wise
np.exp(df)

      first    second     third
a  1.824150  1.264437  2.348816
b  1.065492  2.048628  1.131962
c  1.990999  1.151553  1.122845
d  1.136368  1.303286  1.628621

## 列间运算

In [4]:
df['minus'] = df['first'] - df['second']
df

      first    second     third     minus
a  0.601114  0.234627  0.853911  0.366487
b  0.063437  0.717170  0.123952 -0.653734
c  0.688637  0.141112  0.115866  0.547525
d  0.127837  0.264889  0.487734 -0.137052

In [5]:
df['quadratic'] = df['third'] ** 2
df

      first    second     third     minus  quadratic
a  0.601114  0.234627  0.853911  0.366487   0.729165
b  0.063437  0.717170  0.123952 -0.653734   0.015364
c  0.688637  0.141112  0.115866  0.547525   0.013425
d  0.127837  0.264889  0.487734 -0.137052   0.237884

In [6]:
# 使用drop函数删列、行
df.drop(columns=['minus', 'quadratic'], inplace=True)
df

      first    second     third
a  0.601114  0.234627  0.853911
b  0.063437  0.717170  0.123952
c  0.688637  0.141112  0.115866
d  0.127837  0.264889  0.487734

## replace和apply函数

In [7]:
df['third'] = 1
# 用100代替1
df.replace(1, 100, inplace=True)
df

      first    second  third
a  0.601114  0.234627    100
b  0.063437  0.717170    100
c  0.688637  0.141112    100
d  0.127837  0.264889    100

In [8]:
# 每个元素开平方
df.apply(lambda x: x ** 0.5)

      first    second  third
a  0.775315  0.484383   10.0
b  0.251866  0.846859   10.0
c  0.829841  0.375648   10.0
d  0.357544  0.514674   10.0

In [9]:
# 统计各列的和
df.apply(np.sum, axis=1)

a    100.835741
b    100.780607
c    100.829748
d    100.392726
dtype: float64

## 合并Dataframe

In [10]:
df1 = pd.DataFrame(np.random.randint(0, 10, (2, 3)), index=np.arange(2), columns=['a', 'b', 'c'])
df1

   a  b  c
0  2  9  4
1  4  7  9

In [11]:
df2 = pd.DataFrame(np.random.randint(5, 15, (3, 3)), index=np.arange(4, 7), columns=['a', 'b', 'c'])
df2

    a  b   c
4  11  6  10
5   8  6  14
6   8  7  14

In [12]:
# concat合并
pd.concat([df1, df2])

    a  b   c
0   2  9   4
1   4  7   9
4  11  6  10
5   8  6  14
6   8  7  14